---
kind: other
id: Properties.T:Autodesk.Revit.Exceptions.InvalidObjectException
source: html/c506f19f-5fe2-d052-2038-7021a7d45a7c.htm
---
# InvalidObjectException Properties

The information of the function throwing the exception.